<h1>Titanic</h1>
<h6>Saket Tiwari</h6>
Date: 28 June 2019

In [1444]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [1445]:
dataset=pd.read_csv('datasets/titanic.csv')

In [1446]:
dataset.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [1447]:
dataset.keys()

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [1448]:
dataset.columns=['Id', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

In [1449]:
dataset.drop('Name', axis=1, inplace=True)

In [1450]:
dataset.drop('Id', axis=1, inplace=True)

In [1451]:
dataset.drop('Ticket', axis=1, inplace=True)

In [1452]:
dataset.drop('Fare', axis=1, inplace=True)

In [1453]:
dataset.drop('Cabin', axis=1, inplace=True)

In [1454]:
dataset.drop('Embarked', axis=1, inplace=True)

In [1455]:
dataset.head()

   Survived  Pclass     Sex   Age  SibSp  Parch
0         0       3    male  22.0      1      0
1         1       1  female  38.0      1      0
2         1       3  female  26.0      0      0
3         1       1  female  35.0      1      0
4         0       3    male  35.0      0      0

In [1456]:
from numpy import NaN,nan,NAN

In [1457]:
dataset['Pclass'].value_counts(dropna=False)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [1458]:
dataset['Sex'].value_counts(dropna=False)

male      577
female    314
Name: Sex, dtype: int64

In [1459]:
dataset['Age'].value_counts(dropna=False).head()

NaN     177
24.0     30
22.0     27
18.0     26
28.0     25
Name: Age, dtype: int64

In [1460]:
alpha= dataset['Age'].loc[(dataset.Sex=='male') & (dataset.Survived==1) ].value_counts(dropna=False).head(13)
alpha.head(13)

NaN     16
32.0     7
27.0     6
25.0     4
3.0      4
36.0     4
48.0     3
31.0     3
20.0     3
35.0     3
26.0     3
42.0     3
29.0     3
Name: Age, dtype: int64

In [1461]:
beta=list(alpha.keys().to_numpy())
del beta[0]
beta2=[int(i) for i in beta]

In [1462]:
import random

In [1463]:
dataset['Age'].loc[(dataset.Sex=='male')& (dataset.Survived==1)]=dataset['Age'].replace(to_replace=[NaN],value=random.choice(beta2))

c:\users\professionally_saket\appdata\local\programs\python\python36-32\lib\site-packages\pandas\core\indexing.py:190: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [1464]:
alpha= dataset['Age'].loc[(dataset.Sex=='male') & (dataset.Survived==0) ].value_counts(dropna=False).head(13)
alpha.head(13)

NaN     108
19.0     16
28.0     16
21.0     16
25.0     14
22.0     14
30.0     13
24.0     13
18.0     12
36.0     11
29.0     10
20.0     10
16.0     10
Name: Age, dtype: int64

In [1465]:
beta=list(alpha.keys().to_numpy())
del beta[0]
beta2=[int(i) for i in beta]

In [1466]:
dataset['Age'].loc[(dataset.Sex=='male')& (dataset.Survived==0)]=dataset['Age'].replace(to_replace=[NaN],value=random.choice(beta2))

In [1467]:
alpha= dataset['Age'].loc[(dataset.Sex=='female') & (dataset.Survived==0) ].value_counts(dropna=False).head(4)
alpha.head(4)

NaN     17
18.0     5
9.0      4
2.0      4
Name: Age, dtype: int64

In [1468]:
beta=list(alpha.keys().to_numpy())
del beta[0]
beta2=[int(i) for i in beta]

In [1469]:
dataset['Age'].loc[(dataset.Sex=='female')& (dataset.Survived==0)]=dataset['Age'].replace(to_replace=[NaN],value=random.choice(beta2))

In [1470]:
alpha= dataset['Age'].loc[(dataset.Sex=='female') & (dataset.Survived==1) ].value_counts(dropna=False).head(17)
alpha.head(17)

NaN     36
24.0    14
22.0    10
30.0     9
35.0     8
18.0     8
19.0     7
36.0     7
33.0     6
4.0      5
31.0     5
40.0     5
27.0     5
29.0     5
16.0     5
28.0     5
17.0     5
Name: Age, dtype: int64

In [1471]:
beta=list(alpha.keys().to_numpy())
del beta[0]
beta2=[int(i) for i in beta]

In [1472]:
dataset['Age'].loc[(dataset.Sex=='female')& (dataset.Survived==1)]=dataset['Age'].replace(to_replace=[NaN],value=random.choice(beta2))

In [1473]:
dataset['SibSp'].value_counts(dropna=False)

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [1474]:
dataset['Parch'].value_counts(dropna=False)

0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: Parch, dtype: int64

In [1475]:
dummy=pd.get_dummies(dataset['Sex'])
dummy.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [1476]:
dataset=pd.concat([dataset,dummy],axis=1)
dataset.head()

   Survived  Pclass     Sex   Age  SibSp  Parch  female  male
0         0       3    male  22.0      1      0       0     1
1         1       1  female  38.0      1      0       1     0
2         1       3  female  26.0      0      0       1     0
3         1       1  female  35.0      1      0       1     0
4         0       3    male  35.0      0      0       0     1

In [1477]:
dataset.drop('Sex',axis=1,inplace=True)
dataset.head()

   Survived  Pclass   Age  SibSp  Parch  female  male
0         0       3  22.0      1      0       0     1
1         1       1  38.0      1      0       1     0
2         1       3  26.0      0      0       1     0
3         1       1  35.0      1      0       1     0
4         0       3  35.0      0      0       0     1

In [1478]:
# dataset.drop('female',axis=1,inplace=True)
# dataset.head()

In [1479]:
df_y=dataset['Survived']

In [1480]:
dataset.drop('Survived', axis=1,inplace=True)
dataset.head()

   Pclass   Age  SibSp  Parch  female  male
0       3  22.0      1      0       0     1
1       1  38.0      1      0       1     0
2       3  26.0      0      0       1     0
3       1  35.0      1      0       1     0
4       3  35.0      0      0       0     1

In [1481]:
from sklearn.model_selection import train_test_split

In [1482]:
X_train,X_test,y_train,y_test=train_test_split(dataset,df_y)

In [1483]:
from sklearn.linear_model import LinearRegression

In [1484]:
reg=LinearRegression().fit(X_train,y_train)

In [1485]:
reg.score(X_test,y_test)*100

40.08926419711793

In [1486]:
from sklearn.linear_model import LogisticRegression

In [1487]:
classifier=LogisticRegression().fit(X_train,y_train)

c:\users\professionally_saket\appdata\local\programs\python\python36-32\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

In [1488]:
classifier.score(X_test,y_test)*100

79.82062780269058

In [1489]:
from sklearn.neighbors import KNeighborsClassifier

In [1490]:
neigh=KNeighborsClassifier(n_neighbors=7)

In [1491]:
neigh.fit(X_train,y_train)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=7, p=2,
                     weights='uniform')

In [1492]:
neigh.score(X_test,y_test)*100

83.85650224215246